app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    if @comment.save
---
INSERT INTO `comments` (`content`, `user_id`, `prototype_id`, `created_at`, `updated_at`) VALUES ('asdfasf', 2, 1, '2022-09-07 15:57:31.043613', '2022-09-07 15:57:31.043613')