app/controllers/prototypes_controller.rb

  def index
    @prototype = Prototype.all
---
SELECT `prototypes`.* FROM `prototypes`

  def create
    @prototype = Prototype.create(prototype_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('aaa', 'a', 'a', 2, '2022-09-07 15:57:20.788707', '2022-09-07 15:57:20.788707')
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2022-09-07 15:57:20.798267' WHERE `prototypes`.`id` = 1

  def show
    @prototype = Prototype.find(params[:id])
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def edit
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 1 LIMIT 1

  def update
    prototype = Prototype.find(params[:id])
    if prototype.update(prototype_params)
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2022-09-08 13:09:42.376669' WHERE `prototypes`.`id` = 2